[
    {
        "labs": [
            {
                "college": "College of Engineering",
                "website": "https://www.actl.ece.cmu.edu/",
                "keywords": "",
                "lab_name": "Advanced Chip Test Laboratory",
                "department": "Electrical and Computer Engineering",
                "description": "The Advanced Chip Test Laboratory (ACTL) at Carnegie Mellon researches, develops, and implements new methodologies for detecting, characterizing, and coping with integrated circuit (IC) failures. The lab's research involves hardware design, algorithmic development, simulation, and real silicon experiments with various industrial partners. Its founder and head is Professor Shawn Blanton.",
                "contact_email": "",
                "past_projects": ""
            },
            {
                "college": "",
                "website": "https://research.ece.cmu.edu/~calcm/doku.php",
                "keywords": "",
                "lab_name": "CALCM",
                "department": "",
                "description": "CALCM (pronounced “calcium”) brings together all faculty, staff, and students interested in computer architecture research and education at Carnegie Mellon.",
                "contact_email": "",
                "past_projects": ""
            },
            {
                "college": "",
                "website": "http://www.pdl.cmu.edu/DCO/",
                "keywords": "",
                "lab_name": "Data Center Observatory",
                "department": "",
                "description": "The Data Center Observatory (DCO) is a centerpiece of Carnegie Mellon’s attack on ever-growing data center operational costs. As a data center, it will provide a computation and storage utility to resource-hungry research activities such as data mining, design simulation, network intrusion detection, and visualization. As an observatory, it will provide invaluable real data to systems researchers seeking to understand the sources of operational costs and evaluate novel solutions. Combining the two, it builds on Carnegie Mellon's tradition of actively using and showcasing new computing approaches even as it invents them, pushing the frontiers and staying at the forefront of technology.",
                "contact_email": "",
                "past_projects": ""
            },
            {
                "college": "College of Engineering",
                "website": "http://www.ece.cmu.edu/~mems/",
                "keywords": "",
                "lab_name": "Microelectromechanical Systems Laboratory",
                "department": "Electrical and Computer Engineering",
                "description": "The Microelectromechanical Systems (MEMS) Laboratory is associated jointly with the Department of Electrical and Computer Engineering, Robotics Institute (part of the School of Computer Science), and Institute for Complex Engineered Systems at Carnegie Mellon University. The MEMS Laboratory is developing miniature sensor and actuator systems using batch-fabrication processes, especially integrated-circuit fabrication processes. Research in this area is motivated by the potential to produce high-performance, low-cost miniature sensors and actuators. Smart sensors are made by combining microstructures and circuits on a single silicon chip. Specific research areas of interest include nanometer-scale data storage, microsensors and microactuators, MEMS design tools, micromechanical component modeling, embedded microinstruments, and microrobotics.",
                "contact_email": "",
                "past_projects": ""
            },
            {
                "college": "College of Engineering",
                "website": "http://www.nanofab.ece.cmu.edu/",
                "keywords": "",
                "lab_name": "Claire and John Bertucci Nanotechnology Laboratory",
                "department": "Electrical and Computer Engineering",
                "description": "A premier research laboratory in the College of Engineering, the Claire and John Bertucci Nanofabrication Laboratory is one of the most well-equipped university-based facilities for thin film and nano/micro device development in the United States. The \"Nanofab\" includes a cleanroom with 2,600 square feet of class-100 space and 1,200 square feet of class-10 space, as well as three thin film labs. The Nanofab is a self-supporting facility managed by the Electrical and Computer Engineering Department.",
                "contact_email": "",
                "past_projects": ""
            }
        ]
    }
]